<template>
  <h1>关于这个项目</h1>
  <p>这个项目是出于爱好制作的宝可梦图鉴，本意是发现很少有精美的 pc 端宝可梦图鉴，因此想做一个使用轻便但又好看的网页。</p>
  <p>其实最开始是想做篮球/足球的图鉴的，但是没有找到免费的开源 api, 故在此感谢 https://pokeapi.co/ 提供的免费宝可梦 api 支持。</p>
  <p>受限于数据图片的不足，以及接口的无法定制性（接口数据结构层级太深了，数据很绕，实现一些功能比较繁琐），还有很多效果没有达到。</p>
  <p>这个项目逻辑上没有什么太难的地方，重点放在了一些动画效果上，感谢 codepen 上的一些 demo，让我接触到了一些之前未曾使用过的 css 属性，如：backdrop-filter、mix-blend-mode:screen。也让我对 svg 有了一定了解，使我能够在实习的项目中比较快速的解决了一个需求。</p>
  <p>注：在未科学上网的情况下，宝可梦图片可能无法显示，暂用精灵球替代。</p>
</template>


<style scoped lang='less'>
  p {
    font-size: 1.2em
  }
</style>